a=[5, 15, 20, 7, 18, 4]
a
#[5, 15, 20, 7, 18, 4]


a.append(100) #추가 (맨 뒤에 추가)
a
#[5, 15, 20, 7, 18, 4, 100]


a.insert(2, 200) #삽입 (위치가 2인 인덱스(0 1 2)에 200 삽입
a
#[5, 15, 200, 20, 7, 18, 4, 100]


a.remove(200)
a
#[5, 15, 20, 7, 18, 4, 100]


a.pop() #값으로 삭제 (맨끝값)
#100
a
#[5, 15, 20, 7, 18, 4]


a.pop(2)
#20
a
#[5, 15, 7, 18, 4]


a.insert(1, 88) #위치가 1인 인덱스에 88 추가
a.append(88) #맨 뒤에 88 추가
a
#[5, 88, 15, 7, 18, 4, 88]


a.index(88)
#1 (같은 값이 2개일 때 맨 첫번째 값만 반환해준다)


a.pop(a.index(88)) #(88의 인덱스가 1이니 a.pop(1))
#88


a.append(7)
a
#[5, 15, 7, 18, 4, 88, 7]


a.count(7) #7이 몇개 ?
#2


sum(a) #합계
#144


len(a) #크기
7


sum(a)/len(a) #평균
#20.571428571428573


round(789.5477, 2) #반올림 함수(소수, 소수점 2번째 자리까지 반올림)
#789.55


round(sum(a)/len(a), 2)
#20.57


max(a) #리스트 a의 최댓값
#88


min(a) #리스트 a의 최솟값
#4


#********카피
a
#[5, 15, 7, 18, 4, 88, 7]

b=a #같은주소 shallow copy
b
#[5, 15, 7, 18, 4, 88, 7]

c=a.copy() #다른주소 deep copy
c
#[5, 15, 7, 18, 4, 88, 7]

d=a[:] #다른주소(c와도) deep copy
d
#[5, 15, 7, 18, 4, 88, 7]

e=list(a) #다른주소 deep copy
e
#[5, 15, 7, 18, 4, 88, 7]

a[2]=9999
a
#[5, 15, 9999, 18, 4, 88, 7]

b
#[5, 15, 9999, 18, 4, 88, 7]

c #a와 주소가 달라서
#[5, 15, 7, 18, 4, 88, 7]

d #a와 주소가 달라서
#[5, 15, 7, 18, 4, 88, 7]